{
  "23" : {
    "9:30-10:15" : [
      {
        "key" : "cassandra",
        "title": "Keynote: Health: The Most Important Dev Tool",
        "speaker": "Cassandra Faris",
        "keywords" : "Mental Health, Personal Health, Career Development",
        "about" : "<p>Working in the tech industry often involves spending long hours sitting down, staring at a screen, consuming copious amounts of pizza and caffeine. The work is mentally demanding and can be stressful. In the rush to get everything done, it can be easy to neglect our health. But a healthy body and mind are necessary for effective performance. You’ll leave with a better idea of how to take care of yourself and be a happier, healthier, more productive person.</p>",
        "bio" : "<p>Cassandra Faris is the Director of Talent Management at Improving Columbus, a software development consulting and training company. She is passionate about growing the tech community and its people, regularly attending, speaking at, and helping organize conferences and events. She is President of the Microsoft-focused Dog Food Conference and Marketing Lead for CloudDevelop. She has an MBA in Organizational Leadership, and is an avid tabletop gamer, runner, and soccer fan who travels as much as possible.</p>",
        "role": "Director of Talent Management at Improving Columbus",
        "room" : "206ABCD",
        "klass": "full"
      }
    ],
    "10:30-11:15" : [
      {
        "key" : "tirell",
        "title": "Development with Vue.js",
        "speaker": "Tirell Mckinnon",
        "keywords" : "Vue.js, Beginner",
        "about" : "<p>Vue.js is considered component driven, extensible, approachable, and performant view library. Whether you’re a web dev without the frameworks or have been deep in development with Angular, Ember, or React, Vue has a something for you. In this presentation, we will go over the Vue fundamentals, dive into state management, data fetching with Vue, and then wrap up with building your application for production. Let's get started building and delivering products using Vue.</p>",
        "bio" : "<p>Tirell Mckinnon is a software engineer at Skookum located in Charlotte, NC. Tirell has a background in computer science,  frontend development has always been his passion. Tirell has always had a curiosity of deeply understanding software, he loves solving problems and exploring new technologies. He is a family man, avid learner, hobbyist mountain biker, and a member of the Army National Guard. </p>",
        "role": "Software Engineer at Skookum",
        "room" : "206AB",
        "klass": "fec"
      },
      {
        "key" : "jonah",
        "title": "Monitoring and Instrumentation Best Practices",
        "speaker": "Jonah Kowall",
        "keywords" : "Performance, Monitoring, Big Data",
        "about" : "<p>Monitoring is complicated, and in most organizations consists of far too many tools owned by too many teams.  Fixing monitoring issues requires people, process, and technology. Hear common issues seen in the real world including what should be monitored or collected from a technology and a business perspective. Investigate what instrumentation is most scalable and effective across languages, commonly used APIs, and possibilities for capturing data from common languages.</p>",
        "bio" : "<p>Jonah Kowall trained in computer science and co-founded one of the first content filtering companies in the late 1990’s. Jonah became a security expert committing code to both the FreeBSD project and helped build the first wireless cracking algorithms.</p><p>In 2011 Jonah changed careers, moving to Gartner to focus on availability and performance monitoring and IT operations management (ITOM). Speaking and writing research globally for IT leaders and CIOs. Jonah led Gartner's influential application performance monitoring (APM) and created the network performance monitoring and diagnostics (NPMD) magic quadrants. In 2015 Jonah joined AppDynamics to drive the company’s product strategy, roadmap and vision, while developing entry into new markets and providing valuable technology and business insights.</p>",
        "room" : "206CD",
        "klass": "bea"
      },
      {
        "key" : "hira",
        "title": "UX of Voice Interfaces",
        "speaker": "Hira Javed",
        "keywords" : "UX, Voice",
        "about" : "<p>Alexa, Siri and Google Now are indicative of the fact that as a society we are becoming more and more comfortable with interacting with our tech through voice. No longer mediated by visual elements like links, buttons, levers and sliders, our conversations with machines are becoming more natural and human (or at least we hope!). This creates an interesting design challenge. In the absence of visuals, words matter more than ever. The choice of words and how they are strung together to create meaningful conversations requires a deep understanding of the user’s motivation, intentions and expectations. This talk will focus on how the principles of human communications can be applied to the design of natural and intuitive voice interfaces.</p>",
        "bio" : "<p>Hira is a Design Strategist at Scotiabank's Digital Factory where she helps teams understand their users and make informed design decisions. She was formerly at the Canadian Broadcasting Corporation (CBC) where she led the UX research practice in the Digital Operations department. As an in-house usability consultant for CBC TV, CBC Music, Kids’ CBC, CBC News, CBC Sports and CBC Radio, Hira conducted UX research to inform product decisions from conception to post-launch.</p>",
        "role" : "Design Strategist at ScotiaBank",
        "room" : "200C",
        "klass": "ux"
      }
    ],
    "11:30-12:15" : [
      {
        "key" : "alex",
        "title": "Organizing React Applications",
        "speaker": "Alex Wilmer",
        "keywords" : "React, Architecture, Code Patterns",
        "about" : "<p>Since the release and rise of React, client side architecture has become increasingly modular and there have been dozens of popular, but not necessarily compatible, strategies for organizing applications. There exists a plethora of boilerplates and articles on the subject and it's far too early declare a winner. This talk will examine the top methodologies over the past two years and see how they have evolved.</p>",
        "bio" : "<p>Alex Wilmer has a passion for all things JavaScript. It started with making side scrollers in Flash and has made its way to building research applications with his amazing colleagues at the Ontario Institute for Cancer Research. He spends much of his free time exploring new technologies, languages and frameworks, giving back what he learns to students at Lighthouse Labs and the Stackoverflow community. He also has a passion for open source and encourages everyone to make as many pull requests as possible. Find him on the TorontoJS slack community to say hello and ask any questions you like!</p>",
        "role": "Software Developer at Ontario Institute for Cancer Research",
        "room" : "206AB",
        "klass": "fea"
      },
      {
        "key" : "jane",
        "title": "Good Code: What, Why, and How",
        "speaker": "Jane Prusakova",
        "keywords" : "Code Quality, Java, Code Patterns",
        "about" : "<p>Many programmers are dedicated, or even obsessed, with writing 'good' code. Often we follow certain patterns and practices because we believe they are the best solution for the problem, or because the 'experts' tell us to. In this session, we will discuss what good code really is and what benefits it brings.</p>",
        "bio" : "<p>Jane is a software architect and developer, an Agile proponent, and a great believer in building valuable software that users love to use. She builds large back-end systems that require high-performance and high-reliability, and process vast amounts of data. Jane believes that successful software is created by strong teams, requires good engineering practices, and evolves in close collaboration with the users. As a Principal Consultant for Improving Enterprises, Jane works with distributed teams on distributed software. As a member of a consulting team, Jane is focused on technical excellence, close contact with the client, and rapid iterations.</p>",
        "role": "Principal Consultant at Improving Enterprises",
        "room" : "206CD",
        "klass": "bec"
      },
      {
        "key" : "sage",
        "title": "UX Design for V/A/M Reality",
        "speaker": "Sage Franch",
        "keywords" : "Augmented Reality, Virtual Reality, Mixed Reality",
        "about" : "<p>With virtual, augmented, and mixed reality (collectively referred to as x-reality or xR), we have the ability to build entirely new realms not bound by the laws of the physical world. The tricky bit is making realities that users actually want to experience! In this talk, we'll explore best practices for designing enticing immersive experiences for the reality spectrum.</p>",
        "bio" : "<p>Sage Franch is a Technical Evangelist at Microsoft Canada, developer of holograms and chatbots, and founder of tech lifestyle blog Trendy Techie. Sage specializes in mixed reality computing, cognitive machines, and conversational AI. Her current work includes furthering the use of xR in academic environments and as a tool for remote communication and collaboration.  Prior to this role Sage was a Content Developer at Microsoft Learning Experiences, where she created highly technical online training courses for app development with the Universal Windows Platform. Known internationally as 'the Trendy Techie,' Sage has been recognized for her work with diversity and inclusion in technical fields and STEM education. It is her mission to empower others to build the future with technology. Connect with Sage on Twitter and Instagram, @theTrendyTechie.</p>",
        "role": "Technical Evangelist at Microsoft",
        "room" : "200C",
        "klass": "ux"
      }
    ],
    "12:30-1:00" : [
      {
        "key" : "damian",
        "title": "Lunch & Learn Presented by Microsoft -  DevOps for OSS Developers with Azure and VSTS",
        "speaker": "Damian Brady",
        "keywords" : "Cloud, Containers, Azure",
        "about" : "<p>Visual Studio Team Services is the core of Microsoft’s DevOps solution, and Azure is Microsoft’s powerful cloud platform, but these services are not just for Microsoft developers. Microsoft is truly embracing Open Source with first class support for any language and any platform throughout.
In this session, we’ll walk through a DevOps scenario for node developers. We’ll use VSTS to build and deploy open source software to the new Linux App Service on Azure, without touching Windows or .NET at all. Don’t miss the least Microsoft-y Microsoft demo you’ve ever seen!
 </p>",
        "bio" : "<p>Damian is an Australian Cloud Developer Advocate specializing in DevOps. Formerly a dev at Octopus Deploy and a Microsoft MVP, he has a background in software development and consulting in a broad range of industries. In Australia, he co-organised the Brisbane .Net User Group, and launched the now annual DDD Brisbane conference. He regularly speaks at conferences, User Groups, and other events around the world, and he's been an occasional guest on various podcasts like .NET Rocks and Hanselminutes. Most of the time you'll find him talking to developers and IT Pros to help them get the most out of their DevOps strategies. https://twitter.com/damovisa",
        "room" : "206AB",
        "klass": "full"
      },
      {
        "key" : "google",
        "title": "Lunch & Learn - UX Engineering @ Google",
        "speaker": "Munish Dabas and Dirk Gigander",
        "keywords" : "Prototyping, Design, UX",
        "about" : "<p>'UX Engineering’ is relatively nascent and often misunderstood in our industry, but it is crucial to the product design lifecycle. Learn how this discipline operates at Google, its history and impact there, and find out if your passions and interests make you an ideal fit for this unique skillset.</p>",
        "bio" : "<p><strong>Munish Dabas</strong> - A UX Engineer at Google, Munish applies his user-centric iterative design approach to lead prototyping efforts across Google Maps. Prior to Google he was a product design lead at Amazon, a lead technologist at Sports Illustrated Digital where his work garnered awards from the FWA and AdAge, and an interactive developer at award-winning digital agency and product design firm Fantasy.</p><p><strong>Dirk Ginader</strong> - Dirk has been building websites for 20 years. He built high performing production websites and applications at scale first for an agency in Germany then later for Yahoo in the UK and the US until he joined Google in 2013 as one of its first UX Engineers. He’s passionate about making Google’s many different products a delightful experience for everyone by closely collaborating with designers, researchers, engineers and last but not least the accessibility team.</p>
        ",
        "role": "UX Engineers at Google",
        "room" : "206CD",
        "klass": "full"
      }
    ],
    "1:00-1:45" : [
      {
        "key" : "jason",
        "title": "React Native Ra11y",
        "speaker": "Jason Matthews",
        "keywords" : "React Native, Accesibility",
        "about" : "<p>The React Native platform has taken the world by storm. Big names like Uber, Instagram, Tesla and Facebook are leveraging the platform to accelerate their development process while maintaining high quality.  There is generally a strong correlation between great quality apps and the level of accessibly features built in. We’ll go through the general methods of making your React Native apps accessible and explore some of the gotchas in this endeavour.</p>",
        "bio" : "<p>Lover of all things mobile, accessibility and performance. Passionate about React Native and Javascripts.</p>",
        "role" : "Technical Architect at Sapient Razorfish",
        "room" : "206AB",
        "klass": "fec"
      },
      {
        "key" : "sam",
        "title": "Bowerbirds of Technology: Architecture and Operations at Less-Than-Google Scale",
        "speaker": "Sam Kitajima-Kimbrel",
        "keywords" : "Scale, Ops, *aAS",
        "about" : "<p>While aspiring to Google scale is great, if you try to build for it too early you will lose time and effort that could be used building features and supporting the users you do have. This talk will go into depth on how to evaluate, choose, and deploy technology to meet your customers’ requirements without requiring a small army of engineers to answer 2 AM pages. We’ll go through what you should think about when picking open-source systems (as well as hosted PaaS/IaaS/SaaS providers) to meet your needs: maintainership, extensibility, security, stability, and more. We'll also talk about how to pick realistic goals for your project and business: what are the implications of claiming five nines for the person carrying the pager? How will you communicate with your customers when you’re throwing errors and breaking SLAs? What does disaster recovery mean for your systems, and how much effort will it require to implement and test your DR plan (ahead of time!)?
</p>",
        "bio" : "<p>Sam Kitajima-Kimbrel is a software engineer with many feels about healthy teams, distributed systems, and data storage. Sam has a different hair color every month, enjoys cycling and cooking, and resides in the San Francisco Bay Area with his husband Kameron and their dogs Basil and Mochi.</p>",
        "role": "Principal Engineer at Nuna Inc",
        "room" : "206CD",
        "klass": "bea"
      },
      {
        "key" : "jenn",
        "title": "Accessing Accessible Accessibility",
        "speaker": "Jennifer Wong",
        "keywords" : "Accesibility, Code for Cood, Testing",
        "about" : "<p>The World Health Organization states that one billion people live with disabilities. And estimates put internet usage with a screen reader as high as 3.4% of all internet traffic around the world. Web accessibility can help. So what is web accessibility and who needs it? Is engineering accessibility enough? How do you build an cross-functional accessibility culture? And what can you do to prevent accessibility regressions? I had all the same questions… and only four months to guarantee all our consumer user flows were accessible. Well, what happened? Come learn what it takes to lead a web accessibility movement within your company!</p>",
        "bio" : "<p>Jennifer Wong is a self-taught software engineer at Eventbrite where she spends her days making the web a prettier and more user-friendly place. She has written for Net Magazine and had projects covered by Mashable, Engadget, Gizmodo, and more. Jenn is an avid conference speaker and loves eating, coding, and sleeping.</p>",
        "role" : "Software Engineer at Eventbrite",
        "room" : "200C",
        "klass": "ux"
      }
    ],
    "2:00-2:45" : [
      {
        "key" : "ruy",
        "title": "Node.js server side rendering in the Age of APIs",
        "speaker": "Ruy Adorno",
        "keywords" : "Node.js, API, Microservices",
        "about" : "<p>With the increasing popularity of Universal JavaScript and microservices, more and more front-end developers are taking ownership of their server-side render using Node.js.</p><p>In this talk we'll see how leveraging APIs in both server and client side is giving birth to new libraries and frameworks and what is the role of a front end developer in this post-full stack world.</p>",
        "bio" : "<p>Ruy Adorno is a Front-End Developer with more than 10 years of experience working with the web and the many versions of ECMAScript. Also an avid open source user and contributor.</p>",
        "role": "Senior Front-End Developer at Upgrade",
        "room" : "206AB",
        "klass": "fea"
      },
      {
        "key" : "toria",
        "title": "A Search Index is Not a Database Index",
        "speaker": "Toria Gibbs",
        "keywords" : "Databases, Performance, SQL",
        "about" : "<p>A search engine is not a database. Search systems are optimized for fast search using an internal data structure called an inverted index. Databases have a similar feature to allow quick access, also called an index, but it’s a totally different thing!</p><p>In this talk, Toria Gibbs will take you on a tour of the internals of a search index, comparing it to common implementations of indexing in relational databases. We’ll see how search engines can outperform databases and discuss the tradeoffs in implementing and maintaining such a system. No prior knowledge of database or search index implementations required; experience creating or querying database tables will be helpful.</p>",
        "bio" : "<p>Toria Gibbs is a Senior Software Engineer working on Search Infrastructure at Etsy. She's interested in infrastructure development, distributed systems, and information retrieval (including databases and search systems). Toria holds a computer science degree from the University of Waterloo. In her spare time, Toria bakes desserts for her blog and plays flag football.</p>",
        "role": "Senior Software Engineer at Etsy",
        "room" : "206CD",
        "klass": "bec"
      },
      {
        "key" : "dan",
        "title": "My Sensors Bring All the Peeps to the Yard.",
        "speaker": "Dan Jenkins",
        "keywords" : "Internet of Things, Sensors, JavaScript",
        "about" : "<p>Automating your home or office is easier than ever before. It can be done today using free, open source software and sensors. Placing all the right blocks together can be difficult but not if you're given a push in the right direction. Stop turning on that light at the same time every day - make a machine do it for you.</p>",
        "bio" : "<p>Based in Kent, Dan's is the founder of Nimble Ape Ltd, which he started at the beginning of 2014. Dan loves working with Node.js and with its community, along with his passion for building great architecture for Applications. For the past few years Dan's been building RESTful Hypermedia APIs but recently, he's been working with the exciting WebRTC technology; as a Google Developer Expert in WebRTC his mission is to get more developers looking at and using the technology.</p>",
        "role" : "CEO at Nimble Ape Ltd",
        "room" : "200C",
        "klass": "iot"
      }
    ],
    "3:00-3:45" : [
      {
        "key" : "rohan",
        "title": "React + GraphQL + Elixir/Phoenix",
        "speaker": "Rohan Nair",
        "keywords" : "React, GraphQL, Elixr",
        "about" : "<p>Over the past few months, a competitor and spiritual successor to Ruby on Rails has emerged, in Elixir, using the Phoenix framework. At the same time, Facebook has released a successor to REST - GraphQL. Using the Absinthe library, let's build a GraphQL server in Elixir/Phoenix, and hook it up to a simple React app. The audience will learn about the basics of Elixir/Phoenix, the basics of GraphQL, and how to hook that up to a client-side Application.</p>",
        "bio" : "<p>Rohan is a polyglot developer, architect and experienced technology leader with over a decade of experience with Javascript. He is currently the Head of Engineering at Pungle Payments, building a real-time payments platform with Elixir, Node and React. Outside of code, Rohan is a history aficionado, beer drinker, and chocolate chip cookie critic.</p>",
        "role" : "Head of Engineering at Pungle Payments",
        "room" : "206AB",
        "klass": "fec"
      },
      {
        "key" : "yaroslav",
        "title": "Building Stateful Microservices With Akka",
        "speaker": "Yaroslav Tkachenko",
        "keywords" : "Akka, Microservices, State",
        "about" : "<p>Although most microservices are stateless - they delegate things like persistence and consistency to a database or external storage. But sometimes you benefit when you keep the state inside the application. In this talk I’m going to discuss why you want to build stateful microservices and design choices to make. I’ll use Akka framework and explain tools like Akka Clustering and Akka Persistence in depth and show a few practical examples.</p>",
        "bio" : "<p>Yaroslav Tkachenko is a software engineer interested in distributed systems, microservices, functional programming, modern cloud infrastructure and DevOps practices. Currently Yaroslav is a Senior Software Engineer at Demonware (Activision), working on a large-scale data pipeline.</p><p>Prior to joining Demonware Yaroslav held various leadership roles in multiple startups. He was responsible for designing, developing, delivering and maintaining platform services and cloud infrastructure for mission critical systems.</p>",
        "role": "Senior Software Engineer at Demonware (Activision)",
        "room" : "206CD",
        "klass": "bea"
      },
      {
        "key" : "morgan",
        "title": "Help! Work Is Killing My Creativity",
        "speaker": "Morgan Zion",
        "keywords" : "Career Development, Coaching",
        "about" : "<p>Did you expect your job was going to be more creative? Have you felt like you have become a rusty version of your old artistic self? Do you feel like quitting your job to find a more “creative” one? Step one, DO NOT panic or trade your mouse for a paint brush and black bourret. In this helpful yet playful session, you’ll be brought through steps, tips and inspirations to get you over your creative blockades and into the working world of creativity.</p>",
        "bio" : "<p>As a lover of all experiences both tangible and intangible, Morgan Zion, UX Design Manager and Associate Creative Director , aims to build lasting products and designs. These products and designs of her's carry the very obvious tangible qualities of well-constructed ideas but also convey a deep intangible message.  She is an avid artist and even though she works in the world of tech and is an avid recycler, she stills dies a bit inside when people tell her, 'Print is dead'.  She loves texture and drawing in real time, with no lag, on paper (sorry Mr. Tree).</p>",
        "role": "UX Design Manager at Amazon",
        "room" : "200C",
        "klass": "ux"
      }
    ],
    "4:00-4:45" : [
      {
        "key" : "ben",
        "title": "Isomorphic React sans Node??",
        "speaker": "Ben Ilegbodu",
        "keywords" : "React, Code Patterns, Python/Django",
        "about" : "<p>React is a JavaScript library for building user interfaces that has taken the web development industry by storm. Its declarative syntax and DOM abstraction for components not only make client-side development simple, but also enables server-side rendering of those same components, which enables improved SEO and initial browser load time. But how do you render JavaScript React components server-side if your backend doesn’t run on Node? Learn how Eventbrite successfully integrated React with their Python/Django backend so that you can do the same in yours.</p>",
        "bio" : "<p>Ben is a Christian, a husband and a father of 2 with 10+ years of experience developing user interfaces for the Web. He currently leads and manages Eventbrite’s Frontend Platform team. On the side, Ben also enjoys playing basketball, DIY, watching movies, and blogging (benmvp.com) / tweeting (@benmvp) about his experiences with new web technologies.</p>",
        "role": "Senior UI Engineer &amp; Manager at Eventbrite",
        "room" : "206AB",
        "klass": "fea"
      },
      {
        "key" : "kirsten",
        "title": "Harnessing the Power of the Cloud Through CLIs",
        "speaker": "Kirsten Hunter",
        "keywords" : "Cloud, Command Line, DevOps",
        "about" : "<p>Once upon a time, command line interfaces ruled the world. After a long dry spell, they’re back, here to help us automate and integrate cloud services. Come learn about the CLIs available for various cloud products and the lessons we learned when creating our own. Learn to harness the power of the cloud without writing any code.</p>",
        "bio" : "<p>Kirsten Hunter is an unapologetic hacker and passionate advocate for the development community. Her technical interests range from graph databases to cloud services, and her experience supporting and evangelizing REST APIs has given her a unique perspective on developer success. In her copious free time she’s a gamer, fantasy reader, and all around rabble-rouser. Code samples, recipes, and philosophical musings can be found on her website at http://www.princesspolymath.com</p>",
        "role" : "API Evangelist at Akamai",
        "room" : "206CD",
        "klass": "bea"
      },
      {
        "key" : "cordelia",
        "title": "Inclusive and accessible products and teams",
        "speaker": "B Cordelia Yu",
        "role": "Content &amp; Editorial Strategist at A Yellow Raven",
        "keywords" : "Inclusion, Team Building, Strategy",
        "about" : "<p>The most engaging social media plan or the most inclusive style guide fails if the product is not also accessible. That is why content strategists who care about inclusivity must be at the table to help shape product strategy and business decisions.</p><p>Come hear the lessons from a multi-year effort to help a major national environmental nonprofit—an industry that is both centered around justice and still grappling with its legacy of discrimination—make its programs more inclusive of marginalized communities, as a part of modernizing its editorial, publishing, and programatic processes.</p>",
        "bio" : "<p>Bernard Cordelia Yu is a(n) strategist at the intersection of scholarship, social justice, and policy. They help align organizational, editorial, and product processes in social and environmental justice to make knowledge accessible and inclusive. They love building inclusive spaces to build inclusive teams to build inclusive products to build inclusive communities.</p><p>B Cordelia believes that, like in martial arts, the surest path to rapid response times in any campaign is good preparation and training. Their pronouns are they, them, and their.</p>",
        "room" : "200C",
        "klass": "ts"
      }
    ]
  },
  "24" : {
    "9:30-10:15" : [
      {
        "key" : "hasan",
        "title": "Designing Voice Powered User Experiences for JavaScript Applications",
        "speaker": "Hasan Ahmad",
        "keywords" : "Voice, UX, JavaScript",
        "about" : "<p>As mobile and web applications continue to evolve into broader domains such as wearables and home appliances, voice based user interaction is becoming critical to new products. Advances in speech recognition technology are starting to be utilized by application developers and designers to provide click-free and hands-free user experiences. This talk will explore how Voice and Speech recognition APIs are being made available to JavaScript applications, that run on web and mobile devices.</p>",
        "bio" : "<p>Hasan Ahmad is a Senior Consultant at DEV6 where he develops front-end web applications for large enterprise clients of DEV6. He also builds, maintains and instructs courses at DEV6, related to front-end web application development. Hasan has built mobile and web applications for clients in a variety of industries, including healthcare, building management, finance, telecom, automotive and retail. Hasan leads the Toronto chapter of Developer Circles by Facebook, an online and offline accessible community for app developers in Toronto to learn and share their experiences building on top of the Facebook platform. </a>",
        "role" : "Senior Consultant at Dev6",
        "room" : "206AB",
        "klass": "fec"
      },
      {
        "key" : "elle",
        "title": "Algorithms to live by and why should we care",
        "speaker": "Elle Meredith",
        "keywords" : "Computer Science, Algorithms",
        "about" : "<p>Algorithmic thinking in everyday life in language we can all understand. Learn techniques for solving problems, without all the mathematics jargon. We will explore widely applicable algorithms, and how they reveal themselves in our everyday lives, so that we better understand when we can use them in our programs. These stories will help us approach challenges, and make more educated decisions on what algorithms to use, when, and where.</p>",
        "bio" : "<p>Elle works as a consultant for Blackmill. Before Blackmill, she was a Development Director in the New York City office of thoughtbot. She believes in writing clean code, driven by automatic tests, with agile practices, an even work/life balance, and a respectful and inclusive team culture. She constantly works to improve her understanding of technologies, techniques, anti-patterns, and what is considered best practice.</p>",
        "role": "Consultant at Blackmill",
        "room" : "206CD",
        "klass": "bea"
      },
      {
        "key" : "ivana",
        "title": "Remote Working: Swings &amp; Roundabouts",
        "speaker": "Ivana McConnell",
        "keywords" : "Remote Work, Collaboration, Leadership",
        "about" : "<p>Remote teams, when built right, are a wonderful unicorn of trust, freedom, and creative productivity. However, in pursuing this unicorn, it’s difficult to remember that working remotely is incredibly difficult— professionally, psychologically, and personally. It affects everyone differently— developers, designers, managers, and everyone in between. In this talk we'll dispel some myths around remote teams and collaboration, torture the Sword of Damocles metaphor, and share some learnings around making those remote teams work, both professionally and interpersonally. Hopefully, we'll achieve vaunted unicorn status.</p>",
        "bio" : "<p>Ivana was born in Sarajevo to a civil engineer-turned-translator and a UN Logistics Officer-turned-software engineer, and is now based in Vancouver. She arrived there via Croatia, Scotland, and Toronto, and has previously made a living as a rock climbing instructor and video game tester. The first code problem she remembers solving is figuring out the difference between a local and public URL while sprucing up a Neopets guild page. These days she’s a senior UX designer at Customer.io, and is most interested in the intersections of technology, identity, and data.</p>",
        "role" : "Sr. UI/UX Designer at Customer.io",
        "room" : "200C",
        "klass": "ts"
      }
    ],
    "10:30-11:15" : [
      {
        "key" : "kristina",
        "title": "#noobsec: The Web Security Fundamentals Every Developer Should Know.",
        "speaker": "Kristina Balaam",
        "keywords" : "web security, computer security, application security",
        "about" : "<p>As developers, we understand the importance of writing scalable, quality code. However, there isn’t always a lot of focus on protecting the applications we build and the data we collect. We’ll discuss the fundamentals of web application security, walk through examples of how to write more secure code and explore how to easily pen-test your existing applications for vulnerabilities.</p>",
        "bio" : "<p>Kristina is an Application Security Engineer with Shopify. She builds web and mobile security tools and helps discover vulnerabilities in the existing platform. Prior to Shopify, Kristina led a team of developers building web and mobile applications for enterprise and start-up clients. Kristina graduated with a Bachelor of Computer Science from McGill University in 2012. She volunteers with DEFCON Toronto, founded the Women in Tech Toronto book club and has a serious computer textbook hoarding problem.</p>",
        "role": "Application Security Engineer at Shopify",
        "room" : "206AB",
        "klass": "fea"
      },
      {
        "key" : "dejan",
        "title": "Authentication in Microservice Systems",
        "speaker": "Dejan Glozic",
        "keywords" : "Security, MicroServices, Node.js",
        "about" : "<p>Authentication is a nontrivial yet unavoidable part of any modern Web application. The rise of microservice systems and micro front-ends have added additional complexity to this area. In this talk, I will share a tried and true technique we battle-tested in a a large production Node.js microservice system. You will be able to apply this technique in your own microservice system with relative ease.</p>",
        "bio" : "<p>Dejan Glozic is a Senior Technical Staff Member in IBM Toronto Laboratory, where he spent more than 20 years working on various projects involving Eclipse platform, Web technologies, Node.js, React and microservice systems. Dejan has a wealth of experience with various topics of modern architecture, and considers himself a Full Stack Architect (if such a thing exists). He is proud of being a 'hands on' architect, avoiding slideware and instead trusting in the power of running code. Read Dejan's thoughts on his blog at dejanglozic.com, or follow him on twitter as @dglozic.</p>",
        "role" : "Senior Technical Staff Member, IBM Watson Cloud Platform",
        "room" : "206CD",
        "klass": "bec"
      },
      {
        "key" : "matt",
        "title": "Designing Everyday Privacy and Security",
        "speaker": "Matthew Davey",
        "keywords" : "UX, Privacy, Trust",
        "about" : "<p>Two factor shouldn't be just for security experts and encryption shouldn't be presented as defensive. I will look at security from the position of a utility for everyone. Framing it as friendly, important and placing importance on your personal data. Security and Privacy are complex ideas important to everyone. Learn how to lower the bar to entry using language, layout and levity.</p>",
        "bio" : "<p>I grew up in a little village in England 🇬🇧 but I live in Toronto 🇨🇦 and design for 1Password. Previously I've designed for brands like Ecco, Gucci, HSBC and Microsoft.</p>",
        "role": "Senior Product Designer at AgileBits",
        "room" : "200C",
        "klass": "ux"
      }
    ],
    "11:30-12:15" : [
      {
        "key" : "houssein",
        "title": "Progressive Web Apps",
        "speaker": "Houssein Djirdeh",
        "keywords" : "PWA, Angular 2, React",
        "about" : "<p>PWAs are applications that use modern web capabilities to provide a user experience similar to that of mobile and native apps. This presentation will go over how you can add a number of progressive aspects to your application including faster load times, offline support and the ability to install to your mobile home screen.</p>",
        "bio" : "<p>Houssein is passionate about JavaScript and all things web. Based in Toronto, he works as a JavaScript developer at Rangle.io. On the rare occasions when Houssein is not working on a blog post or his next side project, he enjoys weightlifting and long walks on the beach.</p>",
        "role": "Software Developer at Rangle.io",
        "room" : "206AB",
        "klass": "fec"
      },
      {
        "key" : "chris",
        "title": "Building a Better API with JSON:API",
        "speaker": "Chris Guzman",
        "keywords" : "JSON:API, Microservices, Ruby on Rails",
        "about" : "<p>If you’ve implemented API endpoints or consumed APIs it may bug you that every API seems to be different. What if there was a universal standard that made sense? Enter JSON:API, a standard for creating self explaining JSON APIs. Clients built around JSON:API can efficiently cache responses, sometimes eliminating network requests entirely. This session will teach you how you can get started with JSON:API</p>",
        "bio" : "<p>Chris is a Developer Advocate at Nexmo where he helps developers use their global communications platform. He co-organizes the Baltimore Hackathon, Baltimore’s Google Developer Group, and teaches classes at Betamore.</p>",
        "room" : "206CD",
        "role": "Developer Advocate at Nexmo",
        "klass": "bea"
      },
      {
        "key" : "karina",
        "title": "Combining AI and IoT. New Industrial Revolution",
        "speaker": "Karina Popova",
        "keywords" : "AI, IoT",
        "about" : "<p>Artificial Intelligence (AI) will be more important in making sense of data streamed in from Internet of Things (IoT) devices. What will happen when we will learn how to combine AI & IoT? </p>",
        "bio" : "<p>My short BIO: Karina is a well-known woman in tech, an experienced developer and an international speaker with the Trust of The Audience Award in 2016. She has been worked as Developer Lead last 10 years. She has confident communication, leadership skills across different levels, developed through international professional interaction and engagements with representatives of various government institutions or IT companies using agile environment across the world. Her social responsibility and communicative competence are demonstrated in the organization of professional networks, events and conferences. At the same time she gained public speaking skills through frequent academic presentations, workshops and participation as a speaker at IoT and DevOps conferences. </p>",
        "role": "Head of Development at LINK Mobility GmbH",
        "room" : "200C",
        "klass": "iot"
      }
    ],
    "12:30-1:00" : [
      {
        "key" : "wislang",
        "title": "Lunch & Learn Presented by Microsoft -  Dive into Linux applications on Azure with Web Apps for Containers",
        "speaker": "Aaron Wislang",
        "keywords" : "Cloud, Containers, Azure",
        "about" : "<p>Developers need solutions that help them quickly build, deploy and scale applications without having to maintain the underlying web servers or operating systems. Azure App Service currently hosts more than 1 million cloud applications and App Service on Linux brings the same powerful capabilities, including CI/CD, deployment slots and auto scaling, to a multitude of applications developed with the Open Source platforms we know and love. In this session we’ll be hands-on and dive deeper into Azure App Service on Linux with Python and Go applications using Web App for Containers amongst other container platforms on Azure.</p>",
        "bio" : "<p>Aaron is a Senior Cloud Developer Advocate at Microsoft with well over a decade of software development, systems architecture & security experience across the major clouds, development platforms and industries. His current areas of focus include Code (Go, .NET. python), Clouds, Containers (Docker, Kubernetes) & Security as well as Microsoft, Linux & other Open Source platforms. He joined Microsoft from Rackspace where he was a Senior Systems Architect & Software Developer on the Azure Product & Engineering team. Aaron and his wife currently live in Toronto, Canada with their two boys and their turtle. (More: https://developer.microsoft.com/en-us/advocates/aaron-wislang)</p>",
        "role": "Software Developer at Microsoft",
        "room" : "206AB",
        "klass": "full"
      },
      {
        "key" : "google",
        "title": "Lunch & Learn - UX Engineering @ Google",
        "speaker": "Munish Dabas and Dirk Gigander",
        "keywords" : "Prototyping, Design, UX",
        "about" : "<p>'UX Engineering’ is relatively nascent and often misunderstood in our industry, but it is crucial to the product design lifecycle. Learn how this discipline operates at Google, its history and impact there, and find out if your passions and interests make you an ideal fit for this unique skillset.</p>",
        "bio" : "<p><strong>Munish Dabas</strong> - A UX Engineer at Google, Munish applies his user-centric iterative design approach to lead prototyping efforts across Google Maps. Prior to Google he was a product design lead at Amazon, a lead technologist at Sports Illustrated Digital where his work garnered awards from the FWA and AdAge, and an interactive developer at award-winning digital agency and product design firm Fantasy.</p><p><strong>Dirk Ginader</strong> - Dirk has been building websites for 20 years. He built high performing production websites and applications at scale first for an agency in Germany then later for Yahoo in the UK and the US until he joined Google in 2013 as one of its first UX Engineers. He’s passionate about making Google’s many different products a delightful experience for everyone by closely collaborating with designers, researchers, engineers and last but not least the accessibility team.</p>
        ",
        "role": "UX Engineers at Google",
        "room" : "206CD",
        "klass": "full"
      }
    ],
    "1:00-1:45" : [
      {
        "key" : "robyn",
        "title": "Down the SVG Rabbit Hole",
        "speaker": "Robyn Larsen",
        "keywords" : "SVG, CSS, Animation",
        "about" : "<p>We use Scalable Vector Graphics (SVGs) every day, but how well do we really understand it? More often than not, we are merely scratching the surface of a large and complicated discipline. Most developers and designers don’t realize how powerful and useful SVGs are, you will be surprised at how deep the rabbit hole goes.</p>",
        "bio" : "<p>Robyn Larsen is a former nuclear engineer turned front-end developer, entrepreneur, and speaker. Robyn is also an active community member who advises numerous startups across multiple industries and frequently mentors women in tech and STEM. She is a member of the Technical Advisory Group (TAG) with Microsoft and serves on multiple nonprofit boards. Her tools of choice are product strategy, responsive design, HTML5, CSS3, SVGs and JavaScript. You can find her flying between San Francisco, Toronto and Alberta for client work and surfing waves in Central America during her spare time.</p>",
        "role" : "Front End Developer at Phuse",
        "room" : "206AB",
        "klass": "fec"
      },
      {
        "key" : "arthur",
        "title": "From Commit To Production And Beyond - The Continuous Delivery Pipeline",
        "speaker": "Arthur Maltson",
        "keywords" : "Continuous Delivery",
        "about" : "<p>You’ve probably heard about Continuous Delivery, and maybe you've heard of DevOps, but how are the two related? Throughout this talk you will learn what Continuous Delivery is and why your organization should strive to achieve it. You will then embark on a Continuous Delivery journey that will highlight the level of DevOps maturity an organization should be at to safely deliver to production on a regular basis and keep it running for the long term.</p>",
        "bio" : "<p>Arthur Maltson is a Lead DevOps Engineer at Capital One Canada who’s 70% Dev and 30% Ops. He’s currently practicing DevOps during the day and, as a husband and father he’s also doing DadOps at night. Arthur embodies the Full Stack developer with his passion for infrastructure automation, API crafting, front end development and making work fun by introducing and/or building new tools.</p><p>In his spare time Arthur spends far too much time trying to keep up with the latest tech. He also occasionally blogs, Tweets and commits to OSS.</p>",
        "role" : "Sr. Manager, Software Engineering at CapitalOne",
        "room" : "206CD",
        "klass": "bea"
      },
      {
        "key" : "arushi",
        "title": "Blockchain - Why and how",
        "speaker": "Arushi Srivastava",
        "keywords" : "Blockchain, Beginner, Code Patterns",
        "about" : "<p>This major technology trend has already started software architecture for financial services and insurance industries and is now making its way to other industries like healthcare, supply chain and government. In the next 2-3 years you will have the responsibility of understanding, implementing an/or using Blockchain, just the way you do it for cloud today. This talk will introduce the you to the Blockchain architecture and we will dive deeper into the specifics of its utility, implementation and technical skills requirement. The talk will end with giving the audience specific steps on how to start their Blockchain journey and if already started then how to overcome the roadblocks.</p>",
        "bio" : "<p>Arushi Srivastava is the Senior Director of NTT DATA’s Advance Tech Initiatives Practice. She advises corporate leaders on architecting next generation solutions that result in Digital Transformation. At present, she is leading several internal and customer specific Digital Strategy, Digital Engagement, Design Thinking, IoT and Blockchain initiatives for NTT DATA.   She has ~12 years of professional IT experience in large-scale software projects, leading Digital Strategy, Enterprise Architecture, Business Analysis, Solution Design and development areas. Early in her career, she worked with NTT Data’s Telecommunication and Public Sector clients, where she lead several Enterprise, Solution and System Architecture engagements.</p>",
        "role": "Senior Director at NTT DATA",
        "room" : "200C",
        "klass": "new"
      }
    ],
    "2:00-2:45" : [
      {
        "key" : "henri",
        "title": "In DevTools We Trust",
        "speaker": "Henri Helvetica",
        "keywords" : "Performance, Monitoring, Code Tools",
        "about" : "<p>The modern developer workflow often starts with authoring a simple SPA, followed by a live push, but often concludes with a bottleneck discovery. With near certainty, the application was not tested, despite the availability of a testing tool a keystroke away: option-command-I bka Developer Tools.</p><p>‘In DevTools We Trust’ will equip developers with the capacity to correctly conduct application analysis, and provide solutions in the dissolution of performance bottlenecks.</p>",
        "bio" : "<p>Henri is a freelance developer who has turned his interests to a macédoine of site performance engineering with pinches of user experience. When not reading the deluge of daily research docs and case studies, or indiscriminately auditing sites in devtools, Henri can be found contributing back to the community, co-programming meetups including the Toronto Web Performance Group or volunteering his time for lunch and learns at various bootcamps. Otherwise, he’s tooling with music production software or with near certainty training and focusing on running the fastest 5k possible. </p>",
        "role": "Freelancer",
        "room" : "206AB",
        "klass": "fec"
      },
      {
        "key" : "ole",
        "title": "Get your fancy pants on with Elixir",
        "speaker": "Ole Michaelis",
        "keywords" : "Elixir, Beginner",
        "about" : "<p>With Elixir you get all the power of Erlang and it’s hardened frameworks and libraries like OTP and cowboy with a Ruby-esque syntax. When WhatsApp was sold to Facebook, everyone was talking about Erlang. Everyone wanted to know how it was possible to build such a resilient and highly scalable system. With hot code swapping, the BEAM Machine allows zero downtime deployments and gives you highly available systems.</p>",
        "bio" : "<p>Ole Michaelis is the co-founder of SoCoded, a hackfest and web development conference in Hamburg. He’s a Software Engineer working for DNSimple making Domain Automation a breeze. In his free time, he’s building slidr.io, a hazzle-free slide sharing platform. Ole is passionate about open source software, enjoys traveling, and loves Mexican food. He classifies himself as a 'bad' German as he dislikes beer and soccer – the traditional German past-times. </p>",
        "role": "Senior Software Engineer at DNSimple",
        "room" : "206CD",
        "klass": "new"
      },
      {
        "key" : "shanta",
        "title": "Coding for the Greater Good - An Affordable REST",
        "speaker": "Shanta Nathwani",
        "keywords" : "API, REST, Code for Good",
        "about" : "<p>There are more than 170,000 households on the waiting list for subsidized housing in the City of Toronto. Location isn't the primary search function, yet the website for Toronto Community Housing and the open data don't address some of the most crucial pieces of information needed for people to find housing: size of the unit (i.e., number of bedrooms) and speciality (i.e., accessibility or seniors residence). This talk shows the shortfalls of both of these sources and shows how I turned both of these on their heads, and was able to present this data on a nicely designed, accessible and mobile friendly front-end, all while making the data available through an API, using scraped and mock data in a week as a student. Think of how much money the City of Toronto could save and how much better the search for subsidized housing could be?</p>",
        "bio" : "<p>Shanta is an Instructor in Web Design at Sheridan College and a recent graduate from BrainStation Toronto in their Full Time Web Development program as a Full Stack Web Developer. She has a passion for Open Data and coding for the greater good.</p>",
        "role": "Instructor at Sheridan College",
        "room" : "200C",
        "klass": "bec"
      }
    ],
    "3:00-3:45" : [
      {
        "key" : "jana",
        "title": "Conversing with ES2015 and Generators",
        "speaker": "Jana Beck",
        "keywords" : "ES2015, Code Patterns, Functional",
        "about" : "<p>JavaScript got generator functions in ES2015, but perhaps—unlike other ES2015 features like `const`, computed property names, and arrow functions—you haven’t used them yet. The disruption of the “normal” control flow that occurs with generators can feel a bit like turning your brain inside-out, but generators are definitely useful. In this talk, we’ll seek to understand generators through the metaphor of conversation, modeling the relationship between a generator function and its calling context as a turn-taking relationship, just like a (good) conversation so that JavaScript can provide not just our livelihood but our therapy too.</p>",
        "bio" : "<p>Jana took the long road to web development with a significant delay as a Ph.D. candidate in linguistics doing a lot of scientific computing in Python. Today she creates data visualization applications and tools, typically with a stack including D3, React, and Redux. When she's not coding or sleeping, there's a high probability that Jana is sweating in a dance studio or a gym.</p>",
        "role": "Dataviz Engineer at Stitch Fix",
        "room" : "206AB",
        "klass": "fec"
      },
      {
        "key" : "miroslav",
        "title": "Effective prototyping with Java 9",
        "speaker": "Miroslav Cupak",
        "keywords" : "Java",
        "about" : "  <p>One of the more interesting features of the latest release of the Java platform is undoubtedly JShell, Java’s Read-Eval-Print-Loop implementation, which makes prototyping faster and easier. The release, however, packs many other smaller and less-known features and APIs. In this session, you will learn how to effectively work with JShell, and discover features of Java 9 with its help.</p>",
        "bio" : "<p>Miro is a senior software engineer at DNAstack, where he develops a leading genomics cloud platform. He is a Java enthusiast with expertise in distributed systems and middleware, and the creator of the largest search and discovery engine of human genomic data. In his spare time, he blogs and contributes to several open-source projects.</p>",
        "role": "Senior Software Engineer at DNAstack",
        "room" : "206CD",
        "klass": "bec"
      },
      {
        "key" : "marisam",
        "title": "What Big Data is Missing: Remembering Our Humanity",
        "speaker": "Marisa Morby",
        "keywords" : "Big Data, UX",
        "about" : "<p>What makes people buy something online? Is it the color of a button, the words in the headline, or eye-catching design? Big data tells us that if we get the right combination of these things, we'll see a huge uptick in sales. But what it doesn't account for is the individual. Because each person that clicks buy has a much larger story to tell.</p>",
        "bio" : "<p>Marisa Morby has a background in User Experience copywriting, and marketing. She specializes in digital optimization, user research, and user experience flow for web and mobile applications. She's worked with clients to create a more personal approach to marketing, used data to optimize businesses, and helped her clients connect with customers on a human level. When she's not writing or reading about psychology, she can be found in the wild doing all sorts of things like: eating her way around the world, perfecting a chocolate chip cookie recipe, or sitting in the park doing some serious people watching.</p>",
        "role":"Optimization Director at Clearhead",
        "room" : "200C",
        "klass": "ux"
      }
    ],
    "4:00-4:45" : [
      {
        "key" : "marissa",
        "title": "Keynote: Empowering through mentoring",
        "speaker": "Marissa Levy Lerer",
        "keywords" : "Leadership, Career Development, Coaching",
        "about" : "<p>'Our chief want in life is somebody who will make us do what we can.' — Ralph Waldo Emerson<br /> In tech, we are often left to our own devices to self learn and grow through our own sheer will. We often forget that there are people out there willing and anxious to help pull us to the next rung of our careers. Marissa Lerer, CTO of Compose[d] and mentorship junkie will lead in a discussion about mentorship, leadership and how to effectively give and receive both. </p>",
        "bio" : "<p>Marissa Lerer is a technologist, musician, cake decorator and mom. She received a BS in Music Education and an MA in Graphic Communications, Management and Technology from NYU. She is currently managing a team of developers, as CTO at COMPOSE[D], a digital creative and development agency in New York. Marissa prides herself on being a “cool nerd” who likes to get her hands in everything. She is also an accomplished singer/songwriter who has released three albums. She has also participated in the 2012 StartupBus and was on the winning team of the 2012 International Space Apps Challenge. She is passionate about mentorship, especially for women in tech. In addition to teaching programming at the School of Visual Arts she is also a regular panelist at Pace Path Live and recently mentored Girl Scouts at a SXSW event sponsored by Twitter and Dove. Last year she was the keynote speaker at Full Stack Toronto.</p>",
        "room" : "206ABCD",
        "role" : "CTO at Compose[d]",
        "klass": "full"
      }
    ]
  }
}
